Repository: joanC0492/wordpressongoing-link-shortener
Catalog: languages/*.po
Languages: es_es

source: Are you sure you want to delete this link? This action cannot be undone.
es_es: ¿Estás seguro de que quieres eliminar este enlace? Esta acción no se puede deshacer.

source: Delete this alias? The link will stop working.
es_es: ¿Eliminar este alias? El enlace dejará de funcionar.

source: Copied!
es_es: ¡Copiado!

source: Copy error
es_es: Error al copiar

source: Generating...
es_es: Generando...

source: Rotating...
es_es: Rotando...

source: Deleting...
es_es: Eliminando...

source: Success:
es_es: Éxito:

source: Incomplete data
es_es: Datos incompletos

source: Could not obtain security token
es_es: No se pudo obtener el token de seguridad

source: Connection error
es_es: Error de conexión

source: Copy failed. Select and copy manually:
es_es: Error al copiar. Selecciona y copia manualmente:

source: Link copied:
es_es: Enlace copiado:

source: Generate short link
es_es: Generar short link

source: No URL to copy
es_es: No hay URL para copiar

source: URL must start with http:// or https:// and include a valid domain
es_es: La URL debe comenzar con http:// o https:// e incluir un dominio válido

source: Domain does not seem valid
es_es: El dominio no parece ser válido

source: Error validating URL
es_es: Error al validar URL

source: Connection error while validating URL
es_es: Error de conexión al validar URL

source: Cannot save: the slug is already in use. Please choose another slug.
es_es: No se puede guardar: el slug ya está en uso. Por favor, elige otro slug.

source: Are you sure you want to move this link to trash?
es_es: ¿Estás seguro de que quieres mover este enlace a la papelera?

source: Settings
es_es: Ajustes

source: Links
es_es: Enlaces

source: URL must start with http:// or https://
es_es: La URL debe comenzar con http:// o https://

source: Valid URL
es_es: URL válida

source: Rotate Slug
es_es: Rotar Slug

source: Delete
es_es: Eliminar

source: Regenerate
es_es: Regenerar

source: Regenerating...
es_es: Regenerando...

source: Link generated and copied to clipboard:
es_es: Enlace generado y copiado al portapapeles:

source: Link generated. Could not copy automatically:
es_es: Enlace generado. No se pudo copiar automáticamente:

source: Link ID required
es_es: ID de enlace requerido

source: Original URL required
es_es: URL original requerida

source: Generate a new short link? The current link will keep working.
es_es: ¿Generar un nuevo enlace corto? El enlace actual seguirá funcionando.

source: Cancel
es_es: Cancelar

source: Close modal
es_es: Cerrar modal

source: Choose how you want to update this link's slug:
es_es: Elige cómo quieres actualizar el slug de este enlace:

source: Replace slug
es_es: Reemplazar slug

source: The previous slug will stop working
es_es: El slug anterior dejará de funcionar

source: Add alias
es_es: Añadir alias

source: The previous slug will keep working
es_es: El slug anterior seguirá funcionando

source: New slug (optional):
es_es: Nuevo slug (opcional):

source: Leave empty to generate automatically
es_es: Dejar vacío para generar automáticamente

source: Slug available
es_es: Slug disponible

source: Slug not available
es_es: Slug no disponible

source: This slug is reserved
es_es: Este slug está reservado

source: Prefix must be at least 1 character
es_es: El prefijo debe tener al menos 1 carácter

source: Prefix cannot be more than 20 characters
es_es: El prefijo no puede tener más de 20 caracteres

source: Only letters, numbers, dashes (-) and underscores (_) are allowed
es_es: Solo se permiten letras, números, guiones (-) y guiones bajos (_)

source: Valid prefix
es_es: Prefijo válido

source: Link Shortener Settings
es_es: Ajustes del Link Shortener

source: Link preview:
es_es: Vista previa del enlace:

source: Save Settings
es_es: Guardar Configuración

source: Prefix History
es_es: Historial de Prefijos

source: All previously used prefixes remain active to preserve existing links. New links will use the current prefix.
es_es: Todos los prefijos utilizados anteriormente se mantienen activos para preservar los enlaces existentes. Los nuevos enlaces usarán el prefijo actual.

source: Current
es_es: Actual

source: Statistics
es_es: Estadísticas

source: Links created
es_es: Enlaces creados

source: Prefixes used
es_es: Prefijos usados

source: Help
es_es: Ayuda

source: Prefix:
es_es: Prefijo:

source: Only enter the prefix without slashes (e.g., l, short, go)
es_es: Solo ingresa el prefijo sin slashes (ej: l, short, go)

source: Changes:
es_es: Cambios:

source: Existing links will keep their original prefix
es_es: Los enlaces existentes mantendrán su prefijo original

source: Example:
es_es: Ejemplo:

source: With prefix "l" the link will be domain.com/l/slug
es_es: Con prefijo "l" el enlace será dominio.com/l/slug

source: General Settings
es_es: Configuración General

source: Short link prefix
es_es: Prefijo del enlace corto

source: Configure the prefix used for new short links.
es_es: Configura el prefijo que se usará para los nuevos enlaces cortos.

source: Only enter the prefix (e.g., l, short, go). Only letters, numbers, dashes (-) and underscores (_) are allowed.
es_es: Solo ingresa el prefijo (ej: l, short, go). Solo letras, números, guiones (-) y guiones bajos (_) permitidos.

source: Note:
es_es: Nota:

source: The short link will be created when saving. If you do not specify a slug, one will be generated automatically.
es_es: El enlace corto se creará al guardar. Si no especificas un slug, se generará uno automáticamente.

source: Descriptive label to organize your links (maximum 50 characters)
es_es: Etiqueta descriptiva para organizar tus enlaces (máximo 50 caracteres)

source: Optional. If left empty, one will be generated automatically. Only letters, numbers, dashes and underscores are allowed.
es_es: Opcional. Si se deja vacío, se generará automáticamente. Solo letras, números, guiones y guiones bajos permitidos.

source: This plugin requires PHP 7.4 or higher.
es_es: Este plugin requiere PHP 7.4 o superior.

source: This plugin requires WordPress 5.0 or higher.
es_es: Este plugin requiere WordPress 5.0 o superior.

source: Short Links
es_es: Enlaces Cortos

source: Short Link
es_es: Enlace Corto

source: Add New
es_es: Crear Nuevo

source: Add New Link
es_es: Crear Nuevo Enlace

source: Edit Link
es_es: Editar Enlace

source: New Link
es_es: Nuevo Enlace

source: View Link
es_es: Ver Enlace

source: Search Links
es_es: Buscar Enlaces

source: No links found
es_es: No se encontraron enlaces

source: No links in trash
es_es: No hay enlaces en la papelera

source: All Links
es_es: Todos los Enlaces

source: Original URL
es_es: URL Original

source: Actions
es_es: Acciones

source: Copy
es_es: Copiar

source: Edit
es_es: Editar

source: Link Data
es_es: Datos del Enlace

source: Must start with http:// or https://
es_es: Debe comenzar con http:// o https://

source: Full URL you want to shorten. Must include http:// or https://
es_es: La URL completa que quieres acortar. Debe incluir http:// o https://

source: Custom slug
es_es: Slug personalizado

source: Full link:
es_es: Enlace completo:

source: Error: Original URL is required.
es_es: Error: La URL original es obligatoria.

source: Error: URL must be valid and start with http:// or https://
es_es: Error: La URL debe ser válida y comenzar con http:// o https://

source: Error: URL must include a valid domain.
es_es: Error: La URL debe incluir un dominio válido.

source: Error: You cannot create a short link that points to another short link on the same site.
es_es: Error: No se puede crear un enlace corto que apunte a otro enlace corto del mismo sitio.

source: Error: The slug "%s" is reserved. Please choose another.
es_es: Error: El slug "%s" está reservado. Por favor, elige otro.

source: Error: The slug "%1$s" is already in use. Suggestion: "%2$s"
es_es: Error: El slug "%1$s" ya está en uso. Sugerencia: "%2$s"

source: Short link created:
es_es: Enlace corto creado:

source: Welcome to the main Link Shortener configuration panel.
es_es: Bienvenido al panel principal de configuración del Link Shortener.

source: Plugin Summary
es_es: Resumen del Plugin

source: This plugin allows you to create custom short links
es_es: Este plugin te permite crear enlaces cortos personalizados

source: Quick Access
es_es: Accesos Rápidos

source: View All Links
es_es: Ver Todos los Enlaces

source: Manage Categories
es_es: Gestionar Categorías

source: Invalid nonce
es_es: Nonce inválido

source: Insufficient permissions
es_es: Permisos insuficientes

source: Content is not public
es_es: El contenido no es público

source: A short link already exists for this URL
es_es: Ya existe un enlace corto para esta URL

source: Invalid URL
es_es: URL inválida

source: Error creating short link
es_es: Error al crear el enlace corto

source: Short link generated successfully
es_es: Enlace corto generado exitosamente

source: Link not found
es_es: Enlace no encontrado

source: The slug "%s" is already in use. Try another one.
es_es: El slug "%s" ya está en uso. Intenta con otro.

source: The slug "%s" is reserved.
es_es: El slug "%s" está reservado.

source: Slug replaced successfully. The previous slug is now inactive.
es_es: Slug reemplazado exitosamente. El slug anterior ahora está inactivo.

source: Alias added successfully. Both slugs remain valid.
es_es: Alias añadido exitosamente. Ambos slugs siguen siendo válidos.

source: Invalid action type
es_es: Tipo de acción inválido

source: Error creating new short link
es_es: Error al crear el nuevo enlace corto

source: New short link generated successfully. The previous link remains active.
es_es: Nuevo enlace corto generado exitosamente. El enlace anterior se mantiene activo.

source: Link deleted successfully
es_es: Enlace eliminado exitosamente

source: Error deleting link
es_es: Error al eliminar el enlace

source: Missing required data
es_es: Datos requeridos faltantes

source: Alias is already in use
es_es: El alias ya está en uso

source: Alias is reserved
es_es: El alias está reservado

source: Alias added successfully
es_es: Alias añadido exitosamente

source: No aliases to remove
es_es: No hay aliases para remover

source: Alias removed successfully
es_es: Alias removido exitosamente

source: Alias not found
es_es: Alias no encontrado

source: Slug required
es_es: Slug requerido

source: Invalid URL format
es_es: Formato de URL inválido

source: URL must include a valid domain
es_es: La URL debe incluir un dominio válido

source: Domain is not valid
es_es: El dominio no es válido

source: Cannot create a short link that points to another short link
es_es: No se puede crear un enlace corto que apunte a otro enlace corto

source: Prefix cannot be empty.
es_es: El prefijo no puede estar vacío.

source: Prefix cannot be more than 20 characters.
es_es: El prefijo no puede tener más de 20 caracteres.

source: Prefix must contain only letters, numbers, dashes (-) and underscores (_).
es_es: El prefijo debe contener solo letras, números, guiones (-) y guiones bajos (_).

source: Prefix updated to %s. Existing links continue to work with their original prefixes.
es_es: Prefijo actualizado a %s. Los enlaces existentes continúan funcionando con sus prefijos originales.
